## Plan Result (prod_lb)




<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_lb_backend_address_pool.backend[&#34;crime-portal-bap02-prod&#34;]
  * azurerm_lb_backend_address_pool_address.backend_vm_ip_address[&#34;crime-portal-bap02-prod-crime-portal-frontend-vm01-prod&#34;]
  * azurerm_lb_backend_address_pool_address.backend_vm_ip_address[&#34;crime-portal-bap02-prod-crime-portal-frontend-vm02-prod&#34;]
  * azurerm_lb_probe.probe[&#34;crime-portal-probe02-prod&#34;]
  * azurerm_lb_rule.rule[&#34;crime-portal-rule02-prod&#34;]
* Update
  * azurerm_lb.lb




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_lb.lb will be updated in-place
  ~ resource "azurerm_lb" "lb" {
        id                   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/loadBalancers/crime-portal-lb-prod"
        name                 = "crime-portal-lb-prod"
        tags                 = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (6 unchanged attributes hidden)

      + frontend_ip_configuration {
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "crime-portal-feip02-prod"
          + outbound_rules                = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + subnet_id                     = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-prod-int-01/subnets/crime-portal-lb-prod"
          + zones                         = [
              + "1",
              + "2",
              + "3",
            ]
        }

        # (1 unchanged block hidden)
    }

  # azurerm_lb_backend_address_pool.backend["crime-portal-bap02-prod"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/loadBalancers/crime-portal-lb-prod"
      + name                      = "crime-portal-bap02-prod"
      + outbound_rules            = (known after apply)
    }

  # azurerm_lb_backend_address_pool_address.backend_vm_ip_address["crime-portal-bap02-prod-crime-portal-frontend-vm01-prod"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_vm_ip_address" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.24.246.20"
      + name                          = "crime-portal-frontend-vm01-prod"
      + virtual_network_id            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-prod-int-01"
    }

  # azurerm_lb_backend_address_pool_address.backend_vm_ip_address["crime-portal-bap02-prod-crime-portal-frontend-vm02-prod"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_vm_ip_address" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.24.246.21"
      + name                          = "crime-portal-frontend-vm02-prod"
      + virtual_network_id            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-prod-int-01"
    }

  # azurerm_lb_probe.probe["crime-portal-probe02-prod"] will be created
  + resource "azurerm_lb_probe" "probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/loadBalancers/crime-portal-lb-prod"
      + name                = "crime-portal-probe02-prod"
      + number_of_probes    = 3
      + port                = 443
      + probe_threshold     = 1
      + protocol            = "Https"
      + request_path        = "/"
    }

  # azurerm_lb_rule.rule["crime-portal-rule02-prod"] will be created
  + resource "azurerm_lb_rule" "rule" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 443
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + enable_tcp_reset               = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "crime-portal-feip02-prod"
      + frontend_port                  = 443
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "Default"
      + loadbalancer_id                = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/loadBalancers/crime-portal-lb-prod"
      + name                           = "crime-portal-rule02-prod"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":36,"Program":"tfcmt","SHA1":"","Target":"prod_lb","Vars":{}} -->